class OmanLocations {
  static const Map<String, List<String>> citiesWithDistricts = {
    // المنطقة الوسطى
    "مسقط": ["مسقط", "مطرح", "بوشر", "السيب", "العامرات", "قريات"],
    "ظفار": [
      "صلالة",
      "ثمريت",
      "مرباط",
      "رخيوت",
      "ضلكوت",
      "طاقة",
      "سدح",
      "مقشن",
      "شليم وجزر الحلانيات",
      "حاسك",
    ],
    "مسندم": ["خصب", "بخاء", "دبا", "مدحاء"],
    "البريمي": ["البريمي", "محضة", "السنينة"],

    "الداخلية": [
      "نزوى",
      "بهلاء",
      "منح",
      "أدم",
      "الحمراء",
      "سمائل",
      "بدبد",
      "إزكي",
      "الجبل الأخضر",
    ],
    "الظاهرة": ["عبري", "ينقل", "ضنك"],
    "الوسطى": ["هيما", "محوت", "الدقم", "الجازر"],
    "شمال الباطنة": ["صحار", "شناص", "لوى", "صحم", "الخابورة", "السويق"],
    "جنوب الباطنة": [
      "الرستاق",
      "العوابي",
      "نخل",
      "وادي المعاول",
      "بركاء",
      "المصنعة",
    ],

    // المنطقة الغربية (المدينة المنورة)
    "شمال الشرقية": [
      "إبراء",
      "المضيبي",
      "القابل",
      "بدية",
      "دماء والطائيين",
      "وادي بني خالد",
      "سناو",
    ],
    "جنوب الشرقية": [
      "صور",
      "الكامل والوافي",
      "جعلان بني بوحسن",
      "جعلان بني بوعلي"
          "مصيرة",
    ],
  };

  static List<String> get cities => citiesWithDistricts.keys.toList();

  static List<String> getDistricts(String city) {
    return citiesWithDistricts[city] ?? [];
  }
}
